<a href="https://colab.research.google.com/github/codal-tshah/data-practices-2024/blob/22_apr/PySpark/PySpark_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('SparkExample.com').getOrCreate()

# **Create an empty DataFrame**

In [ ]:
emptyRDD = spark.sparkContext.emptyRDD()
print(emptyRDD)

EmptyRDD[0] at emptyRDD at NativeMethodAccessorImpl.java:0

**Create Empty DataFrame with Schema (StructType)**

In [ ]:
from pyspark.sql.types import StructType,StructField, StringType
schema = StructType([
  StructField('firstname', StringType(), True),
  StructField('middlename', StringType(), True),
  StructField('lastname', StringType(), True)
  ])

In [ ]:
df = spark.createDataFrame(emptyRDD,schema)
df.printSchema()
df.show()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)

+---------+----------+--------+
|firstname|middlename|lastname|
+---------+----------+--------+
+---------+----------+--------+

**Convert Empty RDD to DataFrame**

In [ ]:
df2 = spark.createDataFrame([],schema)
df2.printSchema()
df2.show()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)

+---------+----------+--------+
|firstname|middlename|lastname|
+---------+----------+--------+
+---------+----------+--------+

# **Convert PySpark RDD to DataFrame**

**Create PySpark RDD**

In [ ]:
dept = [("Finance",10),("Marketing",20),("Sales",30),("IT",40)]
rdd = spark.sparkContext.parallelize(dept)

In [ ]:

df = rdd.toDF()
df.printSchema()
df.show(truncate=False)

root
 |-- _1: string (nullable = true)
 |-- _2: long (nullable = true)

+---------+---+
|_1       |_2 |
+---------+---+
|Finance  |10 |
|Marketing|20 |
|Sales    |30 |
|IT       |40 |
+---------+---+

In [ ]:
deptColumns = ["dept_name","dept_id"]
df2 = rdd.toDF(deptColumns)
df2.printSchema()
df2.show(truncate=False)

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

In [ ]:
deptDF = spark.createDataFrame(rdd, schema = deptColumns)
deptDF.printSchema()
deptDF.show(truncate=False)

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

**Completed Example**

In [ ]:
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

dept = [("Finance",10),("Marketing",20),("Sales",30),("IT",40)]
rdd = spark.sparkContext.parallelize(dept)

df = rdd.toDF()
df.printSchema()
df.show(truncate=False)

deptColumns = ["dept_name","dept_id"]
df2 = rdd.toDF(deptColumns)
df2.printSchema()
df2.show(truncate=False)

deptDF = spark.createDataFrame(rdd, schema = deptColumns)
deptDF.printSchema()
deptDF.show(truncate=False)

from pyspark.sql.types import StructType,StructField, StringType
deptSchema = StructType([
    StructField('dept_name', StringType(), True),
    StructField('dept_id', StringType(), True)
])

deptDF1 = spark.createDataFrame(rdd, schema = deptSchema)
deptDF1.printSchema()
deptDF1.show(truncate=False)

root
 |-- _1: string (nullable = true)
 |-- _2: long (nullable = true)

+---------+---+
|_1       |_2 |
+---------+---+
|Finance  |10 |
|Marketing|20 |
|Sales    |30 |
|IT       |40 |
+---------+---+

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: string (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

SHOW()

In [ ]:
df2.show()

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

In [ ]:
df2.show(2,truncate=False)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
+---------+-------+
only showing top 2 rows

In [ ]:
df2.show(2,truncate=3)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|      Fin|     10|
|      Mar|     20|
+---------+-------+
only showing top 2 rows

In [ ]:
df2.show(2,truncate=False, vertical=True)

-RECORD 0--------------
 dept_name | Finance
 dept_id   | 10
-RECORD 1--------------
 dept_name | Marketing
 dept_id   | 20
only showing top 2 rows

In [ ]:
print(df2.schema.json())

{"fields":[{"metadata":{},"name":"dept_name","nullable":true,"type":"string"},{"metadata":{},"name":"dept_id","nullable":true,"type":"long"}],"type":"struct"}

# **StructType & StructField**

In [ ]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType,StructField, StringType, IntegerType,ArrayType,MapType
from pyspark.sql.functions import col,struct,when

spark = SparkSession.builder.master("local[1]") \
                    .appName('SparkByExamples.com') \
                    .getOrCreate()

data = [("James","","Smith","36636","M",3000),
    ("Michael","Rose","","40288","M",4000),
    ("Robert","","Williams","42114","M",4000),
    ("Maria","Anne","Jones","39192","F",4000),
    ("Jen","Mary","Brown","","F",-1)
  ]

schema = StructType([
    StructField("firstname",StringType(),True),
    StructField("middlename",StringType(),True),
    StructField("lastname",StringType(),True),
    StructField("id", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", IntegerType(), True)
  ])

df = spark.createDataFrame(data=data,schema=schema)
df.printSchema()
df.show(truncate=False)

structureData = [
    (("James","","Smith"),"36636","M",3100),
    (("Michael","Rose",""),"40288","M",4300),
    (("Robert","","Williams"),"42114","M",1400),
    (("Maria","Anne","Jones"),"39192","F",5500),
    (("Jen","Mary","Brown"),"","F",-1)
  ]
structureSchema = StructType([
        StructField('name', StructType([
             StructField('firstname', StringType(), True),
             StructField('middlename', StringType(), True),
             StructField('lastname', StringType(), True)
             ])),
         StructField('id', StringType(), True),
         StructField('gender', StringType(), True),
         StructField('salary', IntegerType(), True)
         ])

df2 = spark.createDataFrame(data=structureData,schema=structureSchema)
df2.printSchema()
df2.show(truncate=False)


updatedDF = df2.withColumn("OtherInfo",
    struct(col("id").alias("identifier"),
    col("gender").alias("gender"),
    col("salary").alias("salary"),
    when(col("salary").cast(IntegerType()) < 2000,"Low")
      .when(col("salary").cast(IntegerType()) < 4000,"Medium")
      .otherwise("High").alias("Salary_Grade")
  )).drop("id","gender","salary")

updatedDF.printSchema()
updatedDF.show(truncate=False)


""" Array & Map"""


arrayStructureSchema = StructType([
    StructField('name', StructType([
       StructField('firstname', StringType(), True),
       StructField('middlename', StringType(), True),
       StructField('lastname', StringType(), True)
       ])),
       StructField('hobbies', ArrayType(StringType()), True),
       StructField('properties', MapType(StringType(),StringType()), True)
    ])

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+---------+----------+--------+-----+------+------+
|firstname|middlename|lastname|id   |gender|salary|
+---------+----------+--------+-----+------+------+
|James    |          |Smith   |36636|M     |3000  |
|Michael  |Rose      |        |40288|M     |4000  |
|Robert   |          |Williams|42114|M     |4000  |
|Maria    |Anne      |Jones   |39192|F     |4000  |
|Jen      |Mary      |Brown   |     |F     |-1    |
+---------+----------+--------+-----+------+------+

root
 |-- name: struct (nullable = true)
 |    |-- firstname: string (nullable = true)
 |    |-- middlename: string (nullable = true)
 |    |-- lastname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

+--------------------+-----+------+------+
|name                |id   |gender|salary|
+--------------------+-----+------+------+
|{James, , Smith}    |36636|M     |3100  |
|{Michael, Rose, }   |40288|M     |4300  |
|{Robert, , Williams}|42114|M     |1400  |
|{Maria, Anne, Jones}|39192|F     |5500  |
|{Jen, Mary, Brown}  |     |F     |-1    |
+--------------------+-----+------+------+

root
 |-- name: struct (nullable = true)
 |    |-- firstname: string (nullable = true)
 |    |-- middlename: string (nullable = true)
 |    |-- lastname: string (nullable = true)
 |-- OtherInfo: struct (nullable = false)
 |    |-- identifier: string (nullable = true)
 |    |-- gender: string (nullable = true)
 |    |-- salary: integer (nullable = true)
 |    |-- Salary_Grade: string (nullable = false)

+--------------------+------------------------+
|name                |OtherInfo               |
+--------------------+------------------------+
|{James, , Smith}    |{36636, M, 3100, Medium}|
|{Michael, Rose, }   |{40288, M, 4300, High}  |
|{Robert, , Williams}|{42114, M, 1400, Low}   |
|{Maria, Anne, Jones}|{39192, F, 5500, High}  |
|{Jen, Mary, Brown}  |{, F, -1, Low}          |
+--------------------+------------------------+

# **Column Class | Operators & Functions**

**Create Column Class Object**

In [ ]:
from pyspark.sql.functions import lit
colObj = lit("sparkbyexamples.com")

In [ ]:
data=[("James",23),("Ann",40)]
df=spark.createDataFrame(data).toDF("name","gender")
df.printSchema()

# Using DataFrame object (df)
df.select(df.gender).show()
df.select(df["gender"]).show()
#Accessing column name with dot (with backticks)
df.select(df["`name`"]).show()

#Using SQL col() function
from pyspark.sql.functions import col
df.select(col("gender")).show()
#Accessing column name with dot (with backticks)
df.select(col("`name`")).show()

root
 |-- name: string (nullable = true)
 |-- gender: long (nullable = true)

+------+
|gender|
+------+
|    23|
|    40|
+------+

+------+
|gender|
+------+
|    23|
|    40|
+------+

+-----+
| name|
+-----+
|James|
|  Ann|
+-----+

+------+
|gender|
+------+
|    23|
|    40|
+------+

+-----+
| name|
+-----+
|James|
|  Ann|
+-----+

In [ ]:
data=[("James","Bond","100",None),
      ("Ann","Varsa","200",'F'),
      ("Tom Cruise","XXX","400",''),
      ("Tom Brand",None,"400",'M')]
columns=["fname","lname","id","gender"]
df=spark.createDataFrame(data,columns)
df.show()

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|     James| Bond|100|  NULL|
|       Ann|Varsa|200|     F|
|Tom Cruise|  XXX|400|      |
| Tom Brand| NULL|400|     M|
+----------+-----+---+------+

In [ ]:

#alias
from pyspark.sql.functions import expr
df.select(df.fname.alias("first_name"),
          df.lname.alias("last_name")
   ).show()

#Another example
df.select(expr(" fname ||','|| lname").alias("fullName") \
   ).show()

+----------+---------+
|first_name|last_name|
+----------+---------+
|     James|     Bond|
|       Ann|    Varsa|
|Tom Cruise|      XXX|
| Tom Brand|     NULL|
+----------+---------+

+--------------+
|      fullName|
+--------------+
|    James,Bond|
|     Ann,Varsa|
|Tom Cruise,XXX|
|          NULL|
+--------------+

In [ ]:
df.sort(df.fname.asc()).show()
df.sort(df.fname.desc()).show()

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|       Ann|Varsa|200|     F|
|     James| Bond|100|  NULL|
| Tom Brand| NULL|400|     M|
|Tom Cruise|  XXX|400|      |
+----------+-----+---+------+

+----------+-----+---+------+
|     fname|lname| id|gender|
+----------+-----+---+------+
|Tom Cruise|  XXX|400|      |
| Tom Brand| NULL|400|     M|
|     James| Bond|100|  NULL|
|       Ann|Varsa|200|     F|
+----------+-----+---+------+

In [ ]:
df.filter(df.id.between(100,300)).show()

+-----+-----+---+------+
|fname|lname| id|gender|
+-----+-----+---+------+
|James| Bond|100|  NULL|
|  Ann|Varsa|200|     F|
+-----+-----+---+------+

In [ ]:
df.filter(df.fname.contains("B")).show()

+---------+-----+---+------+
|    fname|lname| id|gender|
+---------+-----+---+------+
|Tom Brand| NULL|400|     M|
+---------+-----+---+------+

In [ ]:
df.select(df.fname,df.lname,df.id) \
  .filter(df.fname.like("%om"))

DataFrame[fname: string, lname: string, id: string]

In [ ]:
from pyspark.sql.functions import when
df.select(df.fname,df.lname,when(df.gender=="M","Male") \
              .when(df.gender=="F","Female") \
              .when(df.gender==None ,"") \
              .otherwise(df.gender).alias("new_gender") \
    ).show()

+----------+-----+----------+
|     fname|lname|new_gender|
+----------+-----+----------+
|     James| Bond|      NULL|
|       Ann|Varsa|    Female|
|Tom Cruise|  XXX|          |
| Tom Brand| NULL|      Male|
+----------+-----+----------+

In [ ]:
df.filter(df.gender.isNull()).show()

+-----+-----+---+------+
|fname|lname| id|gender|
+-----+-----+---+------+
|James| Bond|100|  NULL|
+-----+-----+---+------+

In [ ]:
df.printSchema()

root
 |-- fname: string (nullable = true)
 |-- lname: string (nullable = true)
 |-- id: string (nullable = true)
 |-- gender: string (nullable = true)

In [ ]:
#getItem() used with ArrayType
# df.select(df.languages.getItem(1)).show()

#getItem() used with MapType
df.select(df.lname.getItem("xxx")).show()

AnalysisException: [INVALID_EXTRACT_BASE_FIELD_TYPE] Can't extract a value from "lname". Need a complex type [STRUCT, ARRAY, MAP] but got "STRING".

# **Select Columns**

In [ ]:
import pyspark
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Spark.examples.com").getOrCreate()
data = [("mahesh ihfweoifow", "sci", 15, "ssoa"),
    ("ramesh", "comm", 17, "xaviers"),
    ("fenil a;h;hwo;eihfwoeih", "arts", 16, "dhl"),
    ("kenil", "sci", 18, "infocity")
]
columns = ["Name", "stream", "Age", "School"]
df = spark.createDataFrame(data = data, schema=columns)
df.show()
df.printSchema()

+--------------------+------+---+--------+
|                Name|stream|Age|  School|
+--------------------+------+---+--------+
|   mahesh ihfweoifow|   sci| 15|    ssoa|
|              ramesh|  comm| 17| xaviers|
|fenil a;h;hwo;eih...|  arts| 16|     dhl|
|               kenil|   sci| 18|infocity|
+--------------------+------+---+--------+

root
 |-- Name: string (nullable = true)
 |-- stream: string (nullable = true)
 |-- Age: long (nullable = true)
 |-- School: string (nullable = true)

In [ ]:
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()
data = [("James","Smith","USA","CA"),
    ("Michael","Rose","USA","NY"),
    ("Robert","Williams","USA","CA"),
    ("Maria","Jones","USA","FL")
  ]
columns = ["firstname","lastname","country","state"]
df = spark.createDataFrame(data = data, schema = columns)
df.show(truncate=False)

+---------+--------+-------+-----+
|firstname|lastname|country|state|
+---------+--------+-------+-----+
|James    |Smith   |USA    |CA   |
|Michael  |Rose    |USA    |NY   |
|Robert   |Williams|USA    |CA   |
|Maria    |Jones   |USA    |FL   |
+---------+--------+-------+-----+

In [ ]:
df.select("firstname","lastname").show()
df.select(df.firstname,df.lastname).show()
df.select(df["firstname"],df["lastname"]).show()

#By using col() function
from pyspark.sql.functions import col
df.select(col("firstname"),col("lastname")).show()

#Select columns by regular expression
df.select(df.colRegex("`^.*name*`")).show()

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|    Rose|
|   Robert|Williams|
|    Maria|   Jones|
+---------+--------+

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|    Rose|
|   Robert|Williams|
|    Maria|   Jones|
+---------+--------+

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|    Rose|
|   Robert|Williams|
|    Maria|   Jones|
+---------+--------+

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|    Rose|
|   Robert|Williams|
|    Maria|   Jones|
+---------+--------+

+---------+--------+
|firstname|lastname|
+---------+--------+
|    James|   Smith|
|  Michael|    Rose|
|   Robert|Williams|
|    Maria|   Jones|
+---------+--------+

In [ ]:
df.select(*columns).show()

# Select All columns
df.select([col for col in df.columns]).show()
df.select("*").show()

+---------+--------+-------+-----+
|firstname|lastname|country|state|
+---------+--------+-------+-----+
|    James|   Smith|    USA|   CA|
|  Michael|    Rose|    USA|   NY|
|   Robert|Williams|    USA|   CA|
|    Maria|   Jones|    USA|   FL|
+---------+--------+-------+-----+

+---------+--------+-------+-----+
|firstname|lastname|country|state|
+---------+--------+-------+-----+
|    James|   Smith|    USA|   CA|
|  Michael|    Rose|    USA|   NY|
|   Robert|Williams|    USA|   CA|
|    Maria|   Jones|    USA|   FL|
+---------+--------+-------+-----+

+---------+--------+-------+-----+
|firstname|lastname|country|state|
+---------+--------+-------+-----+
|    James|   Smith|    USA|   CA|
|  Michael|    Rose|    USA|   NY|
|   Robert|Williams|    USA|   CA|
|    Maria|   Jones|    USA|   FL|
+---------+--------+-------+-----+

In [ ]:
#Selects first 3 columns and top 3 rows
df.select(df.columns[:3]).show(3)

#Selects columns 2 to 4  and top 3 r
df.select(df.columns[2:4]).show(3)

+---------+--------+-------+
|firstname|lastname|country|
+---------+--------+-------+
|    James|   Smith|    USA|
|  Michael|    Rose|    USA|
|   Robert|Williams|    USA|
+---------+--------+-------+
only showing top 3 rows

+-------+-----+
|country|state|
+-------+-----+
|    USA|   CA|
|    USA|   NY|
|    USA|   CA|
+-------+-----+
only showing top 3 rows

# **COLLECT()**

**collect() is an action hence it does not return a DataFrame instead, it returns data in an Array to the driver.**

In [ ]:
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

dept = [("Finance",10), \
    ("Marketing",20), \
    ("Sales",30), \
    ("IT",40) \
  ]
deptColumns = ["dept_name","dept_id"]
deptDF = spark.createDataFrame(data=dept, schema = deptColumns)
deptDF.show(truncate=False)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

In [ ]:
dataCollect = deptDF.collect()
print(dataCollect)

[Row(dept_name='Finance', dept_id=10), Row(dept_name='Marketing', dept_id=20), Row(dept_name='Sales', dept_id=30), Row(dept_name='IT', dept_id=40)]

In [ ]:
for row in dataCollect:
    print(row['dept_name'] + "," +str(row['dept_id']))

Finance,10
Marketing,20
Sales,30
IT,40

# **Where Filter**

In [ ]:
from pyspark.sql.types import StructType,StructField
from pyspark.sql.types import StringType, IntegerType, ArrayType
data = [
    (("James","","Smith"),["Java","Scala","C++"],"OH","M"),
    (("Anna","Rose",""),["Spark","Java","C++"],"NY","F"),
    (("Julia","","Williams"),["CSharp","VB"],"OH","F"),
    (("Maria","Anne","Jones"),["CSharp","VB"],"NY","M"),
    (("Jen","Mary","Brown"),["CSharp","VB"],"NY","M"),
    (("Mike","Mary","Williams"),["Python","VB"],"OH","M")
 ]

schema = StructType([
     StructField('name', StructType([
        StructField('firstname', StringType(), True),
        StructField('middlename', StringType(), True),
         StructField('lastname', StringType(), True)
     ])),
     StructField('languages', ArrayType(StringType()), True),
     StructField('state', StringType(), True),
     StructField('gender', StringType(), True)
 ])

df = spark.createDataFrame(data = data, schema = schema)
df.printSchema()
df.show(truncate=False)

root
 |-- name: struct (nullable = true)
 |    |-- firstname: string (nullable = true)
 |    |-- middlename: string (nullable = true)
 |    |-- lastname: string (nullable = true)
 |-- languages: array (nullable = true)
 |    |-- element: string (containsNull = true)
 |-- state: string (nullable = true)
 |-- gender: string (nullable = true)

+----------------------+------------------+-----+------+
|name                  |languages         |state|gender|
+----------------------+------------------+-----+------+
|{James, , Smith}      |[Java, Scala, C++]|OH   |M     |
|{Anna, Rose, }        |[Spark, Java, C++]|NY   |F     |
|{Julia, , Williams}   |[CSharp, VB]      |OH   |F     |
|{Maria, Anne, Jones}  |[CSharp, VB]      |NY   |M     |
|{Jen, Mary, Brown}    |[CSharp, VB]      |NY   |M     |
|{Mike, Mary, Williams}|[Python, VB]      |OH   |M     |
+----------------------+------------------+-----+------+

In [ ]:
df.filter(df.state == "OH").show(truncate=False)

+----------------------+------------------+-----+------+
|name                  |languages         |state|gender|
+----------------------+------------------+-----+------+
|{James, , Smith}      |[Java, Scala, C++]|OH   |M     |
|{Julia, , Williams}   |[CSharp, VB]      |OH   |F     |
|{Mike, Mary, Williams}|[Python, VB]      |OH   |M     |
+----------------------+------------------+-----+------+

In [ ]:
# not equals condition
df.filter(df.state != "OH") \
    .show(truncate=False)
df.filter(~(df.state == "OH")) \
    .show(truncate=False)

+--------------------+------------------+-----+------+
|name                |languages         |state|gender|
+--------------------+------------------+-----+------+
|{Anna, Rose, }      |[Spark, Java, C++]|NY   |F     |
|{Maria, Anne, Jones}|[CSharp, VB]      |NY   |M     |
|{Jen, Mary, Brown}  |[CSharp, VB]      |NY   |M     |
+--------------------+------------------+-----+------+

+--------------------+------------------+-----+------+
|name                |languages         |state|gender|
+--------------------+------------------+-----+------+
|{Anna, Rose, }      |[Spark, Java, C++]|NY   |F     |
|{Maria, Anne, Jones}|[CSharp, VB]      |NY   |M     |
|{Jen, Mary, Brown}  |[CSharp, VB]      |NY   |M     |
+--------------------+------------------+-----+------+

In [ ]:
df.filter("gender <> 'M'").show()

+-------------------+------------------+-----+------+
|               name|         languages|state|gender|
+-------------------+------------------+-----+------+
|     {Anna, Rose, }|[Spark, Java, C++]|   NY|     F|
|{Julia, , Williams}|      [CSharp, VB]|   OH|     F|
+-------------------+------------------+-----+------+

In [ ]:
li=["OH","CA","DE"]
df.filter(df.state.isin(li)).show()

+--------------------+------------------+-----+------+
|                name|         languages|state|gender|
+--------------------+------------------+-----+------+
|    {James, , Smith}|[Java, Scala, C++]|   OH|     M|
| {Julia, , Williams}|      [CSharp, VB]|   OH|     F|
|{Mike, Mary, Will...|      [Python, VB]|   OH|     M|
+--------------------+------------------+-----+------+

In [ ]:
# Filter NOT IS IN List values
#These show all records with NY (NY is not part of the list)
df.filter(~df.state.isin(li)).show()
df.filter(df.state.isin(li)==False).show()

+--------------------+------------------+-----+------+
|                name|         languages|state|gender|
+--------------------+------------------+-----+------+
|      {Anna, Rose, }|[Spark, Java, C++]|   NY|     F|
|{Maria, Anne, Jones}|      [CSharp, VB]|   NY|     M|
|  {Jen, Mary, Brown}|      [CSharp, VB]|   NY|     M|
+--------------------+------------------+-----+------+

+--------------------+------------------+-----+------+
|                name|         languages|state|gender|
+--------------------+------------------+-----+------+
|      {Anna, Rose, }|[Spark, Java, C++]|   NY|     F|
|{Maria, Anne, Jones}|      [CSharp, VB]|   NY|     M|
|  {Jen, Mary, Brown}|      [CSharp, VB]|   NY|     M|
+--------------------+------------------+-----+------+

In [ ]:

# Prepare Data
data2 = [(2,"Michael Rose"),(3,"Robert Williams"),
     (4,"Rames Rose"),(5,"Rames rose")
  ]
df2 = spark.createDataFrame(data = data2, schema = ["id","name"])

# like - SQL LIKE pattern
df2.filter(df2.name.like("%rose%")).show()

+---+----------+
| id|      name|
+---+----------+
|  5|Rames rose|
+---+----------+

In [ ]:
df2.filter(df2.name.rlike("(?i)^*rose$")).show()

+---+------------+
| id|        name|
+---+------------+
|  2|Michael Rose|
|  4|  Rames Rose|
|  5|  Rames rose|
+---+------------+

# **Distinct to Drop Duplicate**

distinct() transformation is used to drop/remove the duplicate rows (all columns) from DataFrame and dropDuplicates() is used to drop rows based on selected (one or multiple) columns.

In [ ]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import expr
spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

data = [("James", "Sales", 3000), \
    ("Michael", "Sales", 4600), \
    ("Robert", "Sales", 4100), \
    ("Maria", "Finance", 3000), \
    ("James", "Sales", 3000), \
    ("Scott", "Finance", 3300), \
    ("Jen", "Finance", 3900), \
    ("Jeff", "Marketing", 3000), \
    ("Kumar", "Marketing", 2000), \
    ("Saif", "Sales", 4100) \
  ]
columns= ["employee_name", "department", "salary"]
df = spark.createDataFrame(data = data, schema = columns)
df.printSchema()
df.show(truncate=False)

#Distinct
distinctDF = df.distinct()
print("Distinct count: "+str(distinctDF.count()))
distinctDF.show(truncate=False)

#Drop duplicates
df2 = df.dropDuplicates()
print("Distinct count: "+str(df2.count()))
df2.show(truncate=False)

#Drop duplicates on selected columns
dropDisDF = df.dropDuplicates(["department","salary"])
print("Distinct count of department salary : "+str(dropDisDF.count()))
dropDisDF.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- salary: long (nullable = true)

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|James        |Sales     |3000  |
|Michael      |Sales     |4600  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|James        |Sales     |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Jeff         |Marketing |3000  |
|Kumar        |Marketing |2000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

Distinct count: 9
+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|Michael      |Sales     |4600  |
|James        |Sales     |3000  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|Jen          |Finance   |3900  |
|Scott        |Finance   |3300  |
|Kumar        |Marketing |2000  |
|Jeff         |Marketing |3000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

Distinct count: 9
+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|Michael      |Sales     |4600  |
|James        |Sales     |3000  |
|Robert       |Sales     |4100  |
|Maria        |Finance   |3000  |
|Jen          |Finance   |3900  |
|Scott        |Finance   |3300  |
|Kumar        |Marketing |2000  |
|Jeff         |Marketing |3000  |
|Saif         |Sales     |4100  |
+-------------+----------+------+

Distinct count of department salary : 8
+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|Maria        |Finance   |3000  |
|Scott        |Finance   |3300  |
|Jen          |Finance   |3900  |
|Kumar        |Marketing |2000  |
|Jeff         |Marketing |3000  |
|James        |Sales     |3000  |
|Robert       |Sales     |4100  |
|Michael      |Sales     |4600  |
+-------------+----------+------+

# **MAP()**

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

data = ["Project",
"Gutenbergs",
"Alices",
"Adventures",
"in",
"Wonderland",
"Project",
"Gutenbergs",
"Adventures",
"in",
"Wonderland",
"Project",
"Gutenbergs"]

rdd=spark.sparkContext.parallelize(data)

rdd2=rdd.map(lambda x: (x,1))
for element in rdd2.collect():
    print(element)

data = [('James','Smith','M',30),
  ('Anna','Rose','F',41),
  ('Robert','Williams','M',62),
]

columns = ["firstname","lastname","gender","salary"]
df = spark.createDataFrame(data=data, schema = columns)
df.show()

rdd2=df.rdd.map(lambda x:
    (x[0]+","+x[1],x[2],x[3]*2)
    )
df2=rdd2.toDF(["name","gender","new_salary"]   )
df2.show()

#Referring Column Names
rdd2=df.rdd.map(lambda x:
    (x["firstname"]+","+x["lastname"],x["gender"],x["salary"]*2)
    )

#Referring Column Names
rdd2=df.rdd.map(lambda x:
    (x.firstname+","+x.lastname,x.gender,x.salary*2)
    )

def func1(x):
    firstName=x.firstname
    lastName=x.lastname
    name=firstName+","+lastName
    gender=x.gender.lower()
    salary=x.salary*2
    return (name,gender,salary)

rdd2=df.rdd.map(lambda x: func1(x))

('Project', 1)
('Gutenbergs', 1)
('Alices', 1)
('Adventures', 1)
('in', 1)
('Wonderland', 1)
('Project', 1)
('Gutenbergs', 1)
('Adventures', 1)
('in', 1)
('Wonderland', 1)
('Project', 1)
('Gutenbergs', 1)
+---------+--------+------+------+
|firstname|lastname|gender|salary|
+---------+--------+------+------+
|    James|   Smith|     M|    30|
|     Anna|    Rose|     F|    41|
|   Robert|Williams|     M|    62|
+---------+--------+------+------+

+---------------+------+----------+
|           name|gender|new_salary|
+---------------+------+----------+
|    James,Smith|     M|        60|
|      Anna,Rose|     F|        82|
|Robert,Williams|     M|       124|
+---------------+------+----------+

# **FLAT MAP()**

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

data = ["Project Gutenbergs",
        "Alices Adventures in Wonderland",
        "Project Gutenbergs",
        "Adventures in Wonderland",
        "Project Gutenbergs"]
rdd=spark.sparkContext.parallelize(data)
for element in rdd.collect():
    print(element)

#Flatmap
rdd2=rdd.flatMap(lambda x: x.split(" "))
for element in rdd2.collect():
    print(element)

Project Gutenbergs
Alices Adventures in Wonderland
Project Gutenbergs
Adventures in Wonderland
Project Gutenbergs
Project
Gutenbergs
Alices
Adventures
in
Wonderland
Project
Gutenbergs
Adventures
in
Wonderland
Project
Gutenbergs

**Unfortunately, PySpark DataFame doesnt have flatMap() transformation however, DataFrame has explode() SQL function that is used to flatten the column.**

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('pyspark-by-examples').getOrCreate()

arrayData = [
        ('James',['Java','Scala'],{'hair':'black','eye':'brown'}),
        ('Michael',['Spark','Java',None],{'hair':'brown','eye':None}),
        ('Robert',['CSharp',''],{'hair':'red','eye':''}),
        ('Washington',None,None),
        ('Jefferson',['1','2'],{})]
df = spark.createDataFrame(data=arrayData, schema = ['name','knownLanguages','properties'])

from pyspark.sql.functions import explode
df2 = df.select(df.name,explode(df.knownLanguages))
df2.printSchema()
df2.show()

root
 |-- name: string (nullable = true)
 |-- col: string (nullable = true)

+---------+------+
|     name|   col|
+---------+------+
|    James|  Java|
|    James| Scala|
|  Michael| Spark|
|  Michael|  Java|
|  Michael|  NULL|
|   Robert|CSharp|
|   Robert|      |
|Jefferson|     1|
|Jefferson|     2|
+---------+------+

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder \
    .master("local[1]") \
    .appName("SparkByExamples.com") \
    .getOrCreate()

df=spark.range(100)
print(df.sample(0.05,123).collect())

[Row(id=36), Row(id=75), Row(id=97)]

# **orderBy() and sort()**

In [ ]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, asc,desc

spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Raman","Finance","CA",99000,40,24000), \
    ("Scott","Finance","NY",83000,36,19000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
columns= ["employee_name","department","state","salary","age","bonus"]

df = spark.createDataFrame(data = simpleData, schema = columns)

df.printSchema()
df.show(truncate=False)

df.sort("department","state").show(truncate=False)
df.sort(col("department"),col("state")).show(truncate=False)

df.orderBy("department","state").show(truncate=False)
df.orderBy(col("department"),col("state")).show(truncate=False)

df.sort(df.department.asc(),df.state.asc()).show(truncate=False)
df.sort(col("department").asc(),col("state").asc()).show(truncate=False)
df.orderBy(col("department").asc(),col("state").asc()).show(truncate=False)

df.sort(df.department.asc(),df.state.desc()).show(truncate=False)
df.sort(col("department").asc(),col("state").desc()).show(truncate=False)
df.orderBy(col("department").asc(),col("state").desc()).show(truncate=False)

df.createOrReplaceTempView("EMP")
spark.sql("select employee_name,department,state,salary,age,bonus from EMP ORDER BY department asc").show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Raman        |Finance   |CA   |99000 |40 |24000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Raman        |Finance   |CA   |99000 |40 |24000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Raman        |Finance   |CA   |99000 |40 |24000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Raman        |Finance   |CA   |99000 |40 |24000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Raman        |Finance   |CA   |99000 |40 |24000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
+-------------+----------+-----+------+---+-----+

# **Union and UnionAll**

In [ ]:
spark = SparkSession.builder.appName('SparkByExamples.com').getOrCreate()

simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000) \
  ]

columns= ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

simpleData2 = [("James","Sales","NY",90000,34,10000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
columns2= ["employee_name","department","state","salary","age","bonus"]

df2 = spark.createDataFrame(data = simpleData2, schema = columns2)

df2.printSchema()
df2.show(truncate=False)

unionDF = df.union(df2)
unionDF.show(truncate=False)
disDF = df.union(df2).distinct()
disDF.show(truncate=False)

unionAllDF = df.unionAll(df2)
unionAllDF.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
+-------------+----------+-----+------+---+-----+

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
+-------------+----------+-----+------+---+-----+

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

# **Transformation**

- pyspark.sql.DataFrame.transform()  Available since Spark 3.0
- pyspark.sql.functions.transform()

In [ ]:
# Imports
from pyspark.sql import SparkSession

# Create SparkSession
spark = SparkSession.builder \
            .appName('SparkByExamples.com') \
            .getOrCreate()

# Prepare Data
simpleData = (("Java",4000,5), \
    ("Python", 4600,10),  \
    ("Scala", 4100,15),   \
    ("Scala", 4500,15),   \
    ("PHP", 3000,20),  \
  )
columns= ["CourseName", "fee", "discount"]

# Create DataFrame
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

root
 |-- CourseName: string (nullable = true)
 |-- fee: long (nullable = true)
 |-- discount: long (nullable = true)

+----------+----+--------+
|CourseName|fee |discount|
+----------+----+--------+
|Java      |4000|5       |
|Python    |4600|10      |
|Scala     |4100|15      |
|Scala     |4500|15      |
|PHP       |3000|20      |
+----------+----+--------+

In [ ]:
from pyspark.sql.functions import upper
def to_upper_str_columns(df):
    return df.withColumn("CourseName",upper(df.CourseName))

# Custom transformation 2
def reduce_price(df,reduceBy):
    return df.withColumn("new_fee",df.fee - reduceBy)

# Custom transformation 3
def apply_discount(df):
    return df.withColumn("discounted_fee",  \
             df.new_fee - (df.new_fee * df.discount) / 100)

In [ ]:
df2 = df.transform(to_upper_str_columns) \
        .transform(reduce_price,1000) \
        .transform(apply_discount)

df2.show()

+----------+----+--------+-------+--------------+
|CourseName| fee|discount|new_fee|discounted_fee|
+----------+----+--------+-------+--------------+
|      JAVA|4000|       5|   3000|        2850.0|
|    PYTHON|4600|      10|   3600|        3240.0|
|     SCALA|4100|      15|   3100|        2635.0|
|     SCALA|4500|      15|   3500|        2975.0|
|       PHP|3000|      20|   2000|        1600.0|
+----------+----+--------+-------+--------------+

In [ ]:
from pyspark.sql import SparkSession

# Create SparkSession
spark = SparkSession.builder \
            .appName('SparkByExamples.com') \
            .getOrCreate()

# Prepare Data
simpleData = (("Java",4000,5), \
    ("Python", 4600,10),  \
    ("Scala", 4100,15),   \
    ("Scala", 4500,15),   \
    ("PHP", 3000,20),  \
  )
columns= ["CourseName", "fee", "discount"]

# Create DataFrame
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

# Custom transformation 1
from pyspark.sql.functions import upper
def to_upper_str_columns(df):
    return df.withColumn("CourseName",upper(df.CourseName))

# Custom transformation 2
def reduce_price(df,reduceBy):
    return df.withColumn("new_fee",df.fee - reduceBy)

# Custom transformation 3
def apply_discount(df):
    return df.withColumn("discounted_fee",  \
             df.new_fee - (df.new_fee * df.discount) / 100)

# transform() usage
df2 = df.transform(to_upper_str_columns) \
        .transform(reduce_price,1000) \
        .transform(apply_discount)

df2.show()

# Create DataFrame with Array
data = [
 ("James,,Smith",["Java","Scala","C++"],["Spark","Java"]),
 ("Michael,Rose,",["Spark","Java","C++"],["Spark","Java"]),
 ("Robert,,Williams",["CSharp","VB"],["Spark","Python"])
]
df = spark.createDataFrame(data=data,schema=["Name","Languages1","Languages2"])
df.printSchema()
df.show()

# using transform() SQL function
from pyspark.sql.functions import upper
from pyspark.sql.functions import transform
df.select(transform("Languages1", lambda x: upper(x)).alias("languages1")) \
  .show()

root
 |-- CourseName: string (nullable = true)
 |-- fee: long (nullable = true)
 |-- discount: long (nullable = true)

+----------+----+--------+
|CourseName|fee |discount|
+----------+----+--------+
|Java      |4000|5       |
|Python    |4600|10      |
|Scala     |4100|15      |
|Scala     |4500|15      |
|PHP       |3000|20      |
+----------+----+--------+

+----------+----+--------+-------+--------------+
|CourseName| fee|discount|new_fee|discounted_fee|
+----------+----+--------+-------+--------------+
|      JAVA|4000|       5|   3000|        2850.0|
|    PYTHON|4600|      10|   3600|        3240.0|
|     SCALA|4100|      15|   3100|        2635.0|
|     SCALA|4500|      15|   3500|        2975.0|
|       PHP|3000|      20|   2000|        1600.0|
+----------+----+--------+-------+--------------+

root
 |-- Name: string (nullable = true)
 |-- Languages1: array (nullable = true)
 |    |-- element: string (containsNull = true)
 |-- Languages2: array (nullable = true)
 |    |-- element: string (containsNull = true)

+----------------+------------------+---------------+
|            Name|        Languages1|     Languages2|
+----------------+------------------+---------------+
|    James,,Smith|[Java, Scala, C++]|  [Spark, Java]|
|   Michael,Rose,|[Spark, Java, C++]|  [Spark, Java]|
|Robert,,Williams|      [CSharp, VB]|[Spark, Python]|
+----------------+------------------+---------------+

+------------------+
|        languages1|
+------------------+
|[JAVA, SCALA, C++]|
|[SPARK, JAVA, C++]|
|      [CSHARP, VB]|
+------------------+

# **fillna() & fill()**

In [ ]:
# Create SparkSession and read csv
from pyspark.sql import SparkSession
spark = SparkSession.builder \
    .master("local[1]") \
    .appName("SparkByExamples.com") \
    .getOrCreate()

filePath="/content/drive/MyDrive/data_practices/pandas/data/air_quality_no2.csv"
df = spark.read.options(header='true', inferSchema='true') \
          .csv(filePath)

df.printSchema()
df.show(truncate=False)

root
 |-- datetime: timestamp (nullable = true)
 |-- station_antwerp: double (nullable = true)
 |-- station_paris: double (nullable = true)
 |-- station_london: double (nullable = true)

+-------------------+---------------+-------------+--------------+
|datetime           |station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|NULL           |NULL         |23.0          |
|2019-05-07 03:00:00|50.5           |25.0         |19.0          |
|2019-05-07 04:00:00|45.0           |27.7         |19.0          |
|2019-05-07 05:00:00|NULL           |50.4         |16.0          |
|2019-05-07 06:00:00|NULL           |61.9         |NULL          |
|2019-05-07 07:00:00|NULL           |72.4         |26.0          |
|2019-05-07 08:00:00|NULL           |77.7         |32.0          |
|2019-05-07 09:00:00|NULL           |67.9         |32.0          |
|2019-05-07 10:00:00|NULL           |56.0         |28.0          |
|2019-05-07 11:00:00|NULL           |34.5         |21.0          |
|2019-05-07 12:00:00|NULL           |20.1         |21.0          |
|2019-05-07 13:00:00|NULL           |13.0         |18.0          |
|2019-05-07 14:00:00|NULL           |10.6         |20.0          |
|2019-05-07 15:00:00|NULL           |13.2         |18.0          |
|2019-05-07 16:00:00|NULL           |11.0         |20.0          |
|2019-05-07 17:00:00|NULL           |11.7         |20.0          |
|2019-05-07 18:00:00|NULL           |18.2         |21.0          |
|2019-05-07 19:00:00|NULL           |22.3         |20.0          |
|2019-05-07 20:00:00|NULL           |21.4         |20.0          |
|2019-05-07 21:00:00|NULL           |26.8         |24.0          |
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
from pyspark.sql.functions import col,isnan, when, count
df.filter(df.station_paris.isNull()).show()

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|           NULL|         NULL|          23.0|
|2019-05-11 05:00:00|           NULL|         NULL|          35.0|
|2019-05-11 06:00:00|           NULL|         NULL|          35.0|
|2019-05-11 07:00:00|           NULL|         NULL|          30.0|
|2019-05-16 08:00:00|           NULL|         NULL|          34.0|
|2019-05-25 05:00:00|           NULL|         NULL|          21.0|
|2019-05-25 06:00:00|           NULL|         NULL|          21.0|
|2019-05-25 07:00:00|           NULL|         NULL|          22.0|
|2019-06-01 05:00:00|           NULL|         NULL|          11.0|
|2019-06-01 06:00:00|           NULL|         NULL|          11.0|
|2019-06-01 07:00:00|           NULL|         NULL|           4.0|
|2019-06-06 17:00:00|           NULL|         NULL|          22.0|
|2019-06-06 18:00:00|           NULL|         NULL|          24.0|
|2019-06-06 19:00:00|           NULL|         NULL|          24.0|
|2019-06-06 20:00:00|           NULL|         NULL|          24.0|
|2019-06-06 21:00:00|           NULL|         NULL|          22.0|
|2019-06-06 22:00:00|           NULL|         NULL|          24.0|
|2019-06-06 23:00:00|           NULL|         NULL|          21.0|
|2019-06-07 00:00:00|           NULL|         NULL|          21.0|
|2019-06-07 01:00:00|           NULL|         NULL|          23.0|
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
dff = df.na.fill(value=0, subset=["station_paris"])
dff.filter(df.station_paris==0.0).show()
dff.show()

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-15 11:00:00|           NULL|          0.0|          36.0|
|2019-05-15 12:00:00|           NULL|          0.0|          35.0|
|2019-05-15 13:00:00|           NULL|          0.0|          30.0|
|2019-05-29 16:00:00|           NULL|          0.0|           5.0|
|2019-05-29 17:00:00|           NULL|          0.0|           3.0|
|2019-06-12 12:00:00|           NULL|          0.0|          35.0|
|2019-06-12 13:00:00|           NULL|          0.0|          33.0|
+-------------------+---------------+-------------+--------------+

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|           NULL|          0.0|          23.0|
|2019-05-07 03:00:00|           50.5|         25.0|          19.0|
|2019-05-07 04:00:00|           45.0|         27.7|          19.0|
|2019-05-07 05:00:00|           NULL|         50.4|          16.0|
|2019-05-07 06:00:00|           NULL|         61.9|          NULL|
|2019-05-07 07:00:00|           NULL|         72.4|          26.0|
|2019-05-07 08:00:00|           NULL|         77.7|          32.0|
|2019-05-07 09:00:00|           NULL|         67.9|          32.0|
|2019-05-07 10:00:00|           NULL|         56.0|          28.0|
|2019-05-07 11:00:00|           NULL|         34.5|          21.0|
|2019-05-07 12:00:00|           NULL|         20.1|          21.0|
|2019-05-07 13:00:00|           NULL|         13.0|          18.0|
|2019-05-07 14:00:00|           NULL|         10.6|          20.0|
|2019-05-07 15:00:00|           NULL|         13.2|          18.0|
|2019-05-07 16:00:00|           NULL|         11.0|          20.0|
|2019-05-07 17:00:00|           NULL|         11.7|          20.0|
|2019-05-07 18:00:00|           NULL|         18.2|          21.0|
|2019-05-07 19:00:00|           NULL|         22.3|          20.0|
|2019-05-07 20:00:00|           NULL|         21.4|          20.0|
|2019-05-07 21:00:00|           NULL|         26.8|          24.0|
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
df.na.fill("unknown",["station_paris"]) \
    .na.fill(" ",["station_london"]).show()

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|           NULL|         NULL|          23.0|
|2019-05-07 03:00:00|           50.5|         25.0|          19.0|
|2019-05-07 04:00:00|           45.0|         27.7|          19.0|
|2019-05-07 05:00:00|           NULL|         50.4|          16.0|
|2019-05-07 06:00:00|           NULL|         61.9|          NULL|
|2019-05-07 07:00:00|           NULL|         72.4|          26.0|
|2019-05-07 08:00:00|           NULL|         77.7|          32.0|
|2019-05-07 09:00:00|           NULL|         67.9|          32.0|
|2019-05-07 10:00:00|           NULL|         56.0|          28.0|
|2019-05-07 11:00:00|           NULL|         34.5|          21.0|
|2019-05-07 12:00:00|           NULL|         20.1|          21.0|
|2019-05-07 13:00:00|           NULL|         13.0|          18.0|
|2019-05-07 14:00:00|           NULL|         10.6|          20.0|
|2019-05-07 15:00:00|           NULL|         13.2|          18.0|
|2019-05-07 16:00:00|           NULL|         11.0|          20.0|
|2019-05-07 17:00:00|           NULL|         11.7|          20.0|
|2019-05-07 18:00:00|           NULL|         18.2|          21.0|
|2019-05-07 19:00:00|           NULL|         22.3|          20.0|
|2019-05-07 20:00:00|           NULL|         21.4|          20.0|
|2019-05-07 21:00:00|           NULL|         26.8|          24.0|
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
df.na.fill({"station_paris": "unknown", "station_london": ""}) \
    .show()

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|           NULL|         NULL|          23.0|
|2019-05-07 03:00:00|           50.5|         25.0|          19.0|
|2019-05-07 04:00:00|           45.0|         27.7|          19.0|
|2019-05-07 05:00:00|           NULL|         50.4|          16.0|
|2019-05-07 06:00:00|           NULL|         61.9|          NULL|
|2019-05-07 07:00:00|           NULL|         72.4|          26.0|
|2019-05-07 08:00:00|           NULL|         77.7|          32.0|
|2019-05-07 09:00:00|           NULL|         67.9|          32.0|
|2019-05-07 10:00:00|           NULL|         56.0|          28.0|
|2019-05-07 11:00:00|           NULL|         34.5|          21.0|
|2019-05-07 12:00:00|           NULL|         20.1|          21.0|
|2019-05-07 13:00:00|           NULL|         13.0|          18.0|
|2019-05-07 14:00:00|           NULL|         10.6|          20.0|
|2019-05-07 15:00:00|           NULL|         13.2|          18.0|
|2019-05-07 16:00:00|           NULL|         11.0|          20.0|
|2019-05-07 17:00:00|           NULL|         11.7|          20.0|
|2019-05-07 18:00:00|           NULL|         18.2|          21.0|
|2019-05-07 19:00:00|           NULL|         22.3|          20.0|
|2019-05-07 20:00:00|           NULL|         21.4|          20.0|
|2019-05-07 21:00:00|           NULL|         26.8|          24.0|
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
dff = df.null.fill(value="unknown", subset=["station_antwerp"])
# dff.filter(df.station_paris=="unknown").show()
dff.show()

AttributeError: 'DataFrame' object has no attribute 'null'

In [ ]:
null_count = df.filter(col('station_antwerp').isNull()).count()
print("Null count in 'station_antwerp' column:", null_count)

Null count in 'station_antwerp' column: 940

In [ ]:

# Check for null and empty string values in 'station_antwerp' column
null_count = df.filter((col('station_antwerp').isNull()) | (col('station_antwerp') == '')).count()

# If there are null or empty string values, replace them with "unknown"
if null_count > 0:
    dff = df.na.fill(value="unknown", subset=["station_antwerp"])
    dff.show()
else:
    print("No null or empty string values found in 'station_antwerp' column.")

+-------------------+---------------+-------------+--------------+
|           datetime|station_antwerp|station_paris|station_london|
+-------------------+---------------+-------------+--------------+
|2019-05-07 02:00:00|           NULL|         NULL|          23.0|
|2019-05-07 03:00:00|           50.5|         25.0|          19.0|
|2019-05-07 04:00:00|           45.0|         27.7|          19.0|
|2019-05-07 05:00:00|           NULL|         50.4|          16.0|
|2019-05-07 06:00:00|           NULL|         61.9|          NULL|
|2019-05-07 07:00:00|           NULL|         72.4|          26.0|
|2019-05-07 08:00:00|           NULL|         77.7|          32.0|
|2019-05-07 09:00:00|           NULL|         67.9|          32.0|
|2019-05-07 10:00:00|           NULL|         56.0|          28.0|
|2019-05-07 11:00:00|           NULL|         34.5|          21.0|
|2019-05-07 12:00:00|           NULL|         20.1|          21.0|
|2019-05-07 13:00:00|           NULL|         13.0|          18.0|
|2019-05-07 14:00:00|           NULL|         10.6|          20.0|
|2019-05-07 15:00:00|           NULL|         13.2|          18.0|
|2019-05-07 16:00:00|           NULL|         11.0|          20.0|
|2019-05-07 17:00:00|           NULL|         11.7|          20.0|
|2019-05-07 18:00:00|           NULL|         18.2|          21.0|
|2019-05-07 19:00:00|           NULL|         22.3|          20.0|
|2019-05-07 20:00:00|           NULL|         21.4|          20.0|
|2019-05-07 21:00:00|           NULL|         26.8|          24.0|
+-------------------+---------------+-------------+--------------+
only showing top 20 rows

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder \
    .master("local[1]") \
    .appName("SparkByExamples.com") \
    .getOrCreate()

filePath="/content/drive/MyDrive/data_practices/pandas/data/air_quality_no2_long.csv"
df = spark.read.options(header='true', inferSchema='true') \
          .csv(filePath)

df.printSchema()
df.show(truncate=False)


df.fillna(value=0).show()
df.fillna(value=0,subset=["location"]).show()
df.na.fill(value=0).show()
df.na.fill(value=0,subset=["value"]).show()


df.fillna(value="").show()
df.na.fill(value="").show()

df.fillna("unknown",["location"]) \
    .fillna("",["parameter"]).show()

df.fillna({"value": "unknown", "parameter": ""}) \
    .show()

df.na.fill("unknown",["value"]) \
    .na.fill("",["parameter"]).show()

df.na.fill({"value": "unknown", "parameter": ""}) \
    .show()

root
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)
 |-- date.utc: timestamp (nullable = true)
 |-- location: string (nullable = true)
 |-- parameter: string (nullable = true)
 |-- value: double (nullable = true)
 |-- unit: string (nullable = true)

+-----+-------+-------------------+--------+---------+-----+-----+
|city |country|date.utc           |location|parameter|value|unit |
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|FR     |2019-06-21 00:00:00|FR04014 |no2      |20.0 |g/m|
|Paris|FR     |2019-06-20 23:00:00|FR04014 |no2      |21.8 |g/m|
|Paris|FR     |2019-06-20 22:00:00|FR04014 |no2      |26.5 |g/m|
|Paris|FR     |2019-06-20 21:00:00|FR04014 |no2      |24.9 |g/m|
|Paris|FR     |2019-06-20 20:00:00|FR04014 |no2      |21.4 |g/m|
|Paris|FR     |2019-06-20 19:00:00|FR04014 |no2      |25.3 |g/m|
|Paris|FR     |2019-06-20 18:00:00|FR04014 |no2      |23.9 |g/m|
|Paris|FR     |2019-06-20 17:00:00|FR04014 |no2      |23.2 |g/m|
|Paris|FR     |2019-06-20 16:00:00|FR04014 |no2      |19.0 |g/m|
|Paris|FR     |2019-06-20 15:00:00|FR04014 |no2      |19.3 |g/m|
|Paris|FR     |2019-06-20 14:00:00|FR04014 |no2      |20.1 |g/m|
|Paris|FR     |2019-06-20 13:00:00|FR04014 |no2      |19.4 |g/m|
|Paris|FR     |2019-06-19 10:00:00|FR04014 |no2      |26.6 |g/m|
|Paris|FR     |2019-06-19 09:00:00|FR04014 |no2      |27.3 |g/m|
|Paris|FR     |2019-06-18 22:00:00|FR04014 |no2      |39.3 |g/m|
|Paris|FR     |2019-06-18 21:00:00|FR04014 |no2      |23.1 |g/m|
|Paris|FR     |2019-06-18 20:00:00|FR04014 |no2      |17.0 |g/m|
|Paris|FR     |2019-06-18 19:00:00|FR04014 |no2      |15.3 |g/m|
|Paris|FR     |2019-06-18 08:00:00|FR04014 |no2      |49.6 |g/m|
|Paris|FR     |2019-06-18 07:00:00|FR04014 |no2      |52.6 |g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

+-----+-------+-------------------+--------+---------+-----+-----+
| city|country|           date.utc|location|parameter|value| unit|
+-----+-------+-------------------+--------+---------+-----+-----+
|Paris|     FR|2019-06-21 00:00:00| FR04014|      no2| 20.0|g/m|
|Paris|     FR|2019-06-20 23:00:00| FR04014|      no2| 21.8|g/m|
|Paris|     FR|2019-06-20 22:00:00| FR04014|      no2| 26.5|g/m|
|Paris|     FR|2019-06-20 21:00:00| FR04014|      no2| 24.9|g/m|
|Paris|     FR|2019-06-20 20:00:00| FR04014|      no2| 21.4|g/m|
|Paris|     FR|2019-06-20 19:00:00| FR04014|      no2| 25.3|g/m|
|Paris|     FR|2019-06-20 18:00:00| FR04014|      no2| 23.9|g/m|
|Paris|     FR|2019-06-20 17:00:00| FR04014|      no2| 23.2|g/m|
|Paris|     FR|2019-06-20 16:00:00| FR04014|      no2| 19.0|g/m|
|Paris|     FR|2019-06-20 15:00:00| FR04014|      no2| 19.3|g/m|
|Paris|     FR|2019-06-20 14:00:00| FR04014|      no2| 20.1|g/m|
|Paris|     FR|2019-06-20 13:00:00| FR04014|      no2| 19.4|g/m|
|Paris|     FR|2019-06-19 10:00:00| FR04014|      no2| 26.6|g/m|
|Paris|     FR|2019-06-19 09:00:00| FR04014|      no2| 27.3|g/m|
|Paris|     FR|2019-06-18 22:00:00| FR04014|      no2| 39.3|g/m|
|Paris|     FR|2019-06-18 21:00:00| FR04014|      no2| 23.1|g/m|
|Paris|     FR|2019-06-18 20:00:00| FR04014|      no2| 17.0|g/m|
|Paris|     FR|2019-06-18 19:00:00| FR04014|      no2| 15.3|g/m|
|Paris|     FR|2019-06-18 08:00:00| FR04014|      no2| 49.6|g/m|
|Paris|     FR|2019-06-18 07:00:00| FR04014|      no2| 52.6|g/m|
+-----+-------+-------------------+--------+---------+-----+-----+
only showing top 20 rows

# **Pivot and Unpivot**

**PySpark pivot() function is used to rotate/transpose the data from one column into multiple Dataframe columns and back using unpivot(). Pivot() It is an aggregation where one of the grouping columns values is transposed into individual columns with distinct data.**

In [ ]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import expr
#Create spark session
data = [("Banana",1000,"USA"), ("Carrots",1500,"USA"), ("Beans",1600,"USA"), \
      ("Orange",2000,"USA"),("Orange",2000,"USA"),("Banana",400,"China"), \
      ("Carrots",1200,"China"),("Beans",1500,"China"),("Orange",4000,"China"), \
      ("Banana",2000,"Canada"),("Carrots",2000,"Canada"),("Beans",2000,"Mexico")]

columns= ["Product","Amount","Country"]
df = spark.createDataFrame(data = data, schema = columns)
df.printSchema()
df.show()

root
 |-- Product: string (nullable = true)
 |-- Amount: long (nullable = true)
 |-- Country: string (nullable = true)

+-------+------+-------+
|Product|Amount|Country|
+-------+------+-------+
| Banana|  1000|    USA|
|Carrots|  1500|    USA|
|  Beans|  1600|    USA|
| Orange|  2000|    USA|
| Orange|  2000|    USA|
| Banana|   400|  China|
|Carrots|  1200|  China|
|  Beans|  1500|  China|
| Orange|  4000|  China|
| Banana|  2000| Canada|
|Carrots|  2000| Canada|
|  Beans|  2000| Mexico|
+-------+------+-------+

In [ ]:
pivotDF = df.groupBy("Product").pivot("Country").sum("Amount")
pivotDF.printSchema()
pivotDF.show(truncate=False)

root
 |-- Product: string (nullable = true)
 |-- Canada: long (nullable = true)
 |-- China: long (nullable = true)
 |-- Mexico: long (nullable = true)
 |-- USA: long (nullable = true)

+-------+------+-----+------+----+
|Product|Canada|China|Mexico|USA |
+-------+------+-----+------+----+
|Orange |NULL  |4000 |NULL  |4000|
|Beans  |NULL  |1500 |2000  |1600|
|Banana |2000  |400  |NULL  |1000|
|Carrots|2000  |1200 |NULL  |1500|
+-------+------+-----+------+----+

In [ ]:

countries = ["USA","China","Canada","Mexico"]
pivotDF = df.groupBy("Product").pivot("Country", countries).sum("Amount")
pivotDF.show(truncate=False)

+-------+----+-----+------+------+
|Product|USA |China|Canada|Mexico|
+-------+----+-----+------+------+
|Orange |4000|4000 |NULL  |NULL  |
|Beans  |1600|1500 |NULL  |2000  |
|Banana |1000|400  |2000  |NULL  |
|Carrots|1500|1200 |2000  |NULL  |
+-------+----+-----+------+------+

In [ ]:

""" unpivot """
unpivotExpr = "stack(3, 'Canada', Canada, 'China', China, 'Mexico', Mexico) as (Country,Total)"
unPivotDF = pivotDF.select("Product", expr(unpivotExpr)) \
    .where("Total is not null")
unPivotDF.show(truncate=False)

+-------+-------+-----+
|Product|Country|Total|
+-------+-------+-----+
|Orange |China  |4000 |
|Beans  |China  |1500 |
|Beans  |Mexico |2000 |
|Banana |Canada |2000 |
|Banana |China  |400  |
|Carrots|Canada |2000 |
|Carrots|China  |1200 |
+-------+-------+-----+

# **PartitionBy()**

PySpark partitionBy() is a function of pyspark.sql.DataFrameWriter class which is used to partition the large dataset (DataFrame) into smaller files based on one or multiple columns while writing to disk,